# Напишите программу, которая будет принимать на вход дробь
# и показывать первую цифру дробной части числа


num = (input('Введите число : '))
print(num.split('.')[1][0]) # команда разделитель
